// Описание на примерните стъпки, включени в реализацията на прост вариант на програма
//  команден интерпретатор /КИ/ - изпълнение на команди без опции и аргументи
// Основни стъпки :
// 	цикъл, в който :
// -	се извежда  промпт
// -	чете се в низ символ по символ ред от файла на стандартния вход като
// - интервалите се пропускат
// - ( тук впоследствие  се включват проверките и подготовка за обработване на специалните за КИ символи  >, <, &, | )
// - символа ‘\n’ се заменя с ‘\0’
// прочитане на конкретна команда (ключова дума)  - logout / quit / bye и пр.
//       /
// до	или
//      \
//	достигане  края на файла на стандартния вход
// - 	изпълнява се  примитив fork, при който
// 	- стартира  детски процес,  в рамките на който  се стартира команда с име прочетения от входа низ
//	 - родителският процес изчаква завършването на детския

// Направете основна обвивка на команден интерпретатор (shell). Програмата непрекъснато
// подканва потребителя с ">>> " и чете команда от потребителя. След това изпълнява командата
// с помощта на fork и execlp. Ако командата е "quit", се излиза. Ако има грешка
// при изпълнението на командата, се извежда съобщение за грешка.

#include <fcntl.h>
#include <stdlib.h>
#include <stdio.h>
#include <unistd.h>
#include <string.h>
#include <wait.h>

char buff[50];

int main()
{
    while (1)
    {
        write(1, ">>>", 4);

        int cnt = 0;
        while (read(0, &buff[cnt], 1) > 0)
        {
            if (buff[cnt] == '\n')
            {
                buff[cnt] = '\0';
                break;
            }

            if (buff[cnt] == ' ')
                continue;

            cnt++;
        }

        if (strcmp(buff, "quit") == 0)
        {
            exit(0);
        }
        else
        {
            if (fork() == 0)
            {
                execlp(buff, buff, NULL);
                exit(1);
            }
            else
            {
                int status;
                wait(&status);

                if (status != 0)
                {
                    printf("ERROR: can't execute command\n");
                }
            }
        }
    }
}