// Да се напише програма на С, която използвайки системни примитиви
// за работа с файлове, чете последователно по един символ от файл,
// чието име е подено като първи параметър и по един символ от стандартния вход.
// Добавя прочетените символи, премахвайки символите ‘0’, ’1’, ’2’, ’3’, ’4’,
// ’5’, ’6’, ’7, ’8, ’9’, последователно след края на файл, чието име е подадено
// като втори параметър/ ако файла несъществува се създава/. Чете се до достигане
// на края на файла или до изчерпване на входния поток.

#include <unistd.h>
#include <fcntl.h>
#include <stdio.h>
#include <stdlib.h>

int main(int argc, char **argv)
{
    int fd1 = open(argv[1], O_RDONLY);
    int fd2 = open(argv[2], O_WRONLY | O_CREAT, 0777);
    if (fd1 == -1 || fd2 == -1)
    {
        perror("File couldn't open");
        exit(-1);
    }

    char buff[2];

    while (read(fd1, buff, 1) > 0)
    {
        if (!(buff[0] >= '1' && buff[0] <= '9'))
        {
            write(fd2, buff, 1);
        }
        write(0," x= ",4);
        read(0, buff, 1);
        if (!(buff[0] >= '1' && buff[0] <= '9'))
        {
            write(fd2, buff, 1);
        }
    }

    close(fd1);
    close(fd2);
}

//input A B C 5 5 5